## Terraform Plan Output
<details><summary>Click to expand</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.firewall.azurerm_firewall.this will be created
  + resource "azurerm_firewall" "this" {
      + dns_proxy_enabled   = (known after apply)
      + firewall_policy_id  = (known after apply)
      + id                  = (known after apply)
      + location            = "eastus2"
      + name                = "acn-vwan-fw01"
      + resource_group_name = "accern-nwsvcs-prd-eus2-rg"
      + sku_name            = "AZFW_Hub"
      + sku_tier            = "Standard"
      + tags                = {
          + "Application" = "hub-firewall"
          + "Environment" = "prd"
          + "ID"          = "00000001"
          + "Owner"       = "Javier.Gaibisso"
        }
      + threat_intel_mode   = (known after apply)
      + zones               = [
          + "1",
        ]

      + virtual_hub {
          + private_ip_address  = (known after apply)
          + public_ip_addresses = (known after apply)
          + public_ip_count     = 2
          + virtual_hub_id      = "/subscriptions/3124b81f-32b6-49f2-98d6-7500ef2a165f/resourceGroups/accern-nwsvcs-prd-eus2-rg/providers/Microsoft.Network/virtualHubs/acn-virtual-hub-prd"
        }
    }

  # module.firewall_policy.azurerm_firewall_policy.this will be created
  + resource "azurerm_firewall_policy" "this" {
      + child_policies           = (known after apply)
      + firewalls                = (known after apply)
      + id                       = (known after apply)
      + location                 = "eastus2"
      + name                     = "acn-vwan-hub-fw-pol01"
      + resource_group_name      = "accern-nwsvcs-prd-eus2-rg"
      + rule_collection_groups   = (known after apply)
      + sku                      = (known after apply)
      + tags                     = {
          + "Application" = "hub-firewall"
          + "Environment" = "prd"
          + "ID"          = "00000001"
          + "Owner"       = "Javier.Gaibisso"
        }
      + threat_intelligence_mode = "Alert"
    }

  # module.rule_collection_group.azurerm_firewall_policy_rule_collection_group.this will be created
  + resource "azurerm_firewall_policy_rule_collection_group" "this" {
      + firewall_policy_id = (known after apply)
      + id                 = (known after apply)
      + name               = "acn-vwan-hub-fw-pol01-rules"
      + priority           = 400

      + application_rule_collection {
          + action   = "Allow"
          + name     = "ApplicationRuleCollection"
          + priority = 600

          + rule {
              + description       = "Allow traffic to Microsoft.com"
              + destination_fqdns = [
                  + "microsoft.com",
                ]
              + name              = "AllowAll"
              + source_addresses  = [
                  + "10.0.0.0/24",
                ]

              + protocols {
                  + port = 443
                  + type = "Https"
                }
            }
        }

      + network_rule_collection {
          + action   = "Allow"
          + name     = "NetworkRuleCollection"
          + priority = 400

          + rule {
              + destination_addresses = [
                  + "*",
                ]
              + destination_ports     = [
                  + "*",
                ]
              + name                  = "OutboundToInternet"
              + protocols             = [
                  + "TCP",
                  + "UDP",
                  + "ICMP",
                ]
              + source_addresses      = [
                  + "*",
                ]
            }
        }
    }

Plan: 3 to add, 0 to change, 0 to destroy.
```
</details>